In [98]:
import pandas as pd

In [99]:
df = pd.read_csv(r"C:\Users\akshi\OneDrive\Desktop\python\emp.csv")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

Q1.

In [100]:
df.shape

(1000, 9)

In [101]:
df.columns

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='object')

In [102]:
df.dtypes

user_id              object
age                  object
salary               object
department           object
join_date            object
city                 object
performance_score    object
experience_years     object
is_active            object
dtype: object

Q2.

In [103]:
#3
missing_percentage = (df.isnull().sum() / len(df)) * 100
missing_percentage

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

Q3

In [104]:
#4
df.apply(lambda col: col.map(type).nunique())

user_id              2
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

Q4

In [105]:
#5
df['user_id'].replace({'':'NaN'})
df['user_id']=df['user_id'].str.upper()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [106]:
#6
import numpy as np
import pandas as pd
df['age'] = pd.to_numeric(df['age'], errors='coerce')
df.loc[(df['age'] < 0) | (df['age'] > 100), 'age'] = np.nan
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,NaN,25000,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [107]:
#7
df['salary'] = (df['salary'].astype(str).str.replace('₹',' ', regex=False).replace('N/A', np.nan))
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,nan,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,nan,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,NaN,25000,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [108]:
#8
df['join_date']=pd.to_datetime(df['join_date'], errors='coerce',dayfirst=True)

In [109]:
#9
df['department']=df['department'].str.strip().str.upper()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,50000,HR,2020-01-12,DELHI,3,five,True
1,U1001,30.0,45000,FINANCE,NaT,Delhi,3,1,yes
2,U1002,30.0,25000,HR,NaT,Delhi,excellent,10,False
3,NaN,NaN,nan,HR,NaT,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000,HR,NaT,DELHI,2,five,NaN
996,U1996,NaN,nan,IT,NaT,Mumbai,NaN,5,no
997,USER_997,NaN,25000,HR,NaT,Mumbai,3,5,True
998,U1998,NaN,25000,NaN,NaT,Bangalore,1,0,True
999,NaN,30.0,45000,HR,NaT,Hyderabad,excellent,five,no

In [110]:
#10
df['city']=df['city'].str.strip().str.title()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,50000,HR,2020-01-12,Delhi,3,five,True
1,U1001,30.0,45000,FINANCE,NaT,Delhi,3,1,yes
2,U1002,30.0,25000,HR,NaT,Delhi,excellent,10,False
3,NaN,NaN,nan,HR,NaT,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000,HR,NaT,Delhi,2,five,NaN
996,U1996,NaN,nan,IT,NaT,Mumbai,NaN,5,no
997,USER_997,NaN,25000,HR,NaT,Mumbai,3,5,True
998,U1998,NaN,25000,NaN,NaT,Bangalore,1,0,True
999,NaN,30.0,45000,HR,NaT,Hyderabad,excellent,five,no

In [111]:
#11
performance_map={'poor':0,'excellent':1}
df['performance_score']=df['performance_score'].map(performance_map)
df['performance_score']=pd.to_numeric(df['performance_score'],errors='coerce')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,50000,HR,2020-01-12,Delhi,NaN,five,True
1,U1001,30.0,45000,FINANCE,NaT,Delhi,NaN,1,yes
2,U1002,30.0,25000,HR,NaT,Delhi,1.0,10,False
3,NaN,NaN,nan,HR,NaT,Hyderabad,1.0,5,yes
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000,HR,NaT,Delhi,NaN,five,NaN
996,U1996,NaN,nan,IT,NaT,Mumbai,NaN,5,no
997,USER_997,NaN,25000,HR,NaT,Mumbai,NaN,5,True
998,U1998,NaN,25000,NaN,NaT,Bangalore,NaN,0,True
999,NaN,30.0,45000,HR,NaT,Hyderabad,1.0,five,no

In [112]:
#12
df['experience_years']=df['experience_years'].replace({'five':5})
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,50000,HR,2020-01-12,Delhi,NaN,5,True
1,U1001,30.0,45000,FINANCE,NaT,Delhi,NaN,1,yes
2,U1002,30.0,25000,HR,NaT,Delhi,1.0,10,False
3,NaN,NaN,nan,HR,NaT,Hyderabad,1.0,5,yes
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000,HR,NaT,Delhi,NaN,5,NaN
996,U1996,NaN,nan,IT,NaT,Mumbai,NaN,5,no
997,USER_997,NaN,25000,HR,NaT,Mumbai,NaN,5,True
998,U1998,NaN,25000,NaN,NaT,Bangalore,NaN,0,True
999,NaN,30.0,45000,HR,NaT,Hyderabad,1.0,5,no

In [113]:
#13

df['is_active']=df['is_active'].replace({'yes':'True','no':'False'})
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,50000,HR,2020-01-12,Delhi,NaN,5,True
1,U1001,30.0,45000,FINANCE,NaT,Delhi,NaN,1,True
2,U1002,30.0,25000,HR,NaT,Delhi,1.0,10,False
3,NaN,NaN,nan,HR,NaT,Hyderabad,1.0,5,True
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000,HR,NaT,Delhi,NaN,5,NaN
996,U1996,NaN,nan,IT,NaT,Mumbai,NaN,5,False
997,USER_997,NaN,25000,HR,NaT,Mumbai,NaN,5,True
998,U1998,NaN,25000,NaN,NaT,Bangalore,NaN,0,True
999,NaN,30.0,45000,HR,NaT,Hyderabad,1.0,5,False

In [114]:
#14

df['user_id']=df['user_id'].drop_duplicates()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,50000,HR,2020-01-12,Delhi,NaN,5,True
1,U1001,30.0,45000,FINANCE,NaT,Delhi,NaN,1,True
2,U1002,30.0,25000,HR,NaT,Delhi,1.0,10,False
3,NaN,NaN,nan,HR,NaT,Hyderabad,1.0,5,True
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000,HR,NaT,Delhi,NaN,5,NaN
996,U1996,NaN,nan,IT,NaT,Mumbai,NaN,5,False
997,USER_997,NaN,25000,HR,NaT,Mumbai,NaN,5,True
998,U1998,NaN,25000,NaN,NaT,Bangalore,NaN,0,True
999,NaN,30.0,45000,HR,NaT,Hyderabad,1.0,5,False

In [115]:
#15
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,50000,HR,2020-01-12,Delhi,NaN,5,True
1,U1001,30.0,45000,FINANCE,NaT,Delhi,NaN,1,True
2,U1002,30.0,25000,HR,NaT,Delhi,1.0,10,False
3,NaN,NaN,nan,HR,NaT,Hyderabad,1.0,5,True
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000,HR,NaT,Delhi,NaN,5,NaN
996,U1996,NaN,nan,IT,NaT,Mumbai,NaN,5,False
997,USER_997,NaN,25000,HR,NaT,Mumbai,NaN,5,True
998,U1998,NaN,25000,NaN,NaT,Bangalore,NaN,0,True
999,NaN,30.0,45000,HR,NaT,Hyderabad,1.0,5,False